// 1. 
// Оголоси дві змінні, productName для назви товару, і pricePerItem для зберігання ціни за штуку. 
// При оголошенні надай змінним наступні значення:
// назва - рядок "Droid";
// ціна за штуку - число 2000.


// 2. 
// Ім'я товару змінили на "Repair droid" і збільшили його ціну на 1500 кредитів. 
// Перевизнач значення змінних pricePerItem і productName після їх оголошення.


//3.
// Оголоси наступні змінні, використовуючи ключове слово const або let, і присвой їм відповідні значення.
// topSpeed - число 160.
// distance - число 617.54.
// login - рядок "mango935".
// isOnline - буль true.
// isAdmin - буль false.

//4
// Доповни код, присвоївши змінній totalPrice вираз для підрахунку загальної суми замовлення. 
// Змінна pricePerItem зберігає ціну однієї одиниці товару, а orderedQuantity - кількість одиниць товару в замовленні.
// const pricePerItem = 3500;
// const orderedQuantity = 4;


//5
// Оголоси змінну message і запиши в неї повідомлення про покупку, рядок у форматі: "You picked <назва товару>, price per item is <ціна товару> credits". 
// Де <назва товару> і <ціна товару> — це значення змінних productName і pricePerItem. 
// Використовуй синтаксис шаблонних рядків.

//6
// Магазин з продажу ремонтних дроїдів готовий до відкриття, залишилося написати скрипт для їх замовлення. Оголоси змінні та присвой їм відповідні значення:
// pricePerDroid - ціна одного дроїда, значення 800
// orderedQuantity - кількість дроїдів у замовленні, значення 6
// deliveryFee - вартість доставки, значення 50
// totalPrice - загальна сума замовлення до сплати, не забудь про вартість доставки
// message - повідомлення про стан замовлення у форматі "You ordered droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price."

//7
//Оголоси функцію sayHi, всередині якої додай console.log() з рядком "Hello, this is my first function!".
//Після оголошення виклич функцію sayHi.

//8
// Функція add повинна вміти додавати три числа і виводити результат у консоль. Додай функції add три параметри: a, b і c, які будуть отримувати значення аргументів під час її виклику.
// Доповни console.log() таким чином, щоб він логував рядок "Addition result equals <result>", де <result> - це сума переданих чисел.


//9
// Доповни код функції add таким чином, щоб вона повертала результат додавання значень трьох параметрів: a, b і c.
// Виклик add(15, 27, 10) повертає 52
// Виклик add(10, 20, 30) повертає 60
// Виклик add(5, 10, 15) повертає 30
// function add(a, b, c) {
//     return a+b+c;
//  }
    

//10
// Функція makeMessage(name, price) складає і повертає повідомлення про покупку. 
// Вона оголошує два параметри, значення яких будуть задаватися під час її виклику.
// name - назва товару
// price - ціна товару
// Доповни код функції таким чином, щоб у змінну message записувався рядок "You picked <product name>, price per item is <product price> credits", де <product name> і <product price> - це значення параметрів name і price. 
// Використовуй синтаксис шаблонних рядків.


//11
// Функція calculateTotalPrice рахує та повертає загальну суму покупки на основі кількості товарів у замовленні та ціни за одиницю товару. Вона приймає два параметри, значення яких будуть задаватися під час її виклику.
// orderedQuantity - кількість одиниць товару у замовленні
// pricePerItem - ціна за одиницю товару
// Доповни код функції так, щоб загальна сума покупки була присвоєна змінній totalPrice. Загальна сума покупки отримується шляхом множення кількості замовлених товарів на ціну одиниці.

//12
// Функція makeOrderMessage(orderedQuantity, pricePerDroid, deliveryFee) складає і повертає повідомлення про покупку ремонтних дроїдів. Вона оголошує три параметри, значення яких будуть задаватися під час її виклику.
// orderedQuantity - кількість дроїдів у замовленні
// pricePerDroid - ціна одного дроїда
// deliveryFee - вартість доставки
// Доповни код функції таким чином, щоб вона повертала повідомлення про замовлення у форматі "You ordered droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price.". 
// Не забудь про ціну доставки в обчисленнях загальної вартості.

//13
//Функція isAdult оголошує один параметр age (вік), значення якого буде задаватися під час її виклику. Присвой змінній passed вираз перевірки віку користувача на повноліття. 
//Людина вважається повнолітньою у віці 18 років і старше.

//14
//Функція isValidPassword (password) перевіряє рівність збереженого і введеного паролів і повертає результат перевірки - буль true або false. Змінна SAVED_PASSWORD зберігає значення попередньо збереженого пароля. 
//Введений пароль передається у параметр password.
//Присвой змінній isMatch вираз перевірки рівності введених і попередньо збережених паролів. Результатом виразу перевірки повинно бути true, якщо значення збігаються, і false - якщо ні.



